retsimx/tlsr8266_mesh/sdk/vendor/light_8258/main_light.c
/********************************************************************************************************
 * @file     main_light.c 
 *
 * @brief    for TLSR chips
 *
 * @author	 telink
 *
 * @par      Copyright (c) Telink Semiconductor (Shanghai) Co., Ltd.
 *           All rights reserved.
 *           
 *			 The information contained herein is confidential and proprietary property of Telink 
 * 		     Semiconductor (Shanghai) Co., Ltd. and is available under the terms 
 *			 of Commercial License Agreement between Telink Semiconductor (Shanghai) 
 *			 Co., Ltd. and the licensee in separate contract or the terms described here-in. 
 *           This heading MUST NOT be removed from this file.
 *
 * 			 Licensees are granted free, non-transferable use of the information in this 
 *			 file under Mutual Non-Disclosure Agreement. NO WARRENTY of ANY KIND is provided. 
 *           
 *******************************************************************************************************/
#include "../../proj/tl_common.h"
#include "../../proj/mcu/watchdog_i.h"
#include "../../proj_lib/rf_drv.h"
#include "../../proj_lib/pm.h"
#include "../../proj_lib/light_ll/light_ll.h"
#include "../../proj_lib/light_ll/light_frame.h"
#include "../../proj_lib/ble_ll/service.h"
#include "../common/rtc.h"
#include "../../proj/drivers/flash.h"
#include "../common/common.h"
#include "../common/scene.h"
#include "../../proj_lib/ble_ll/blueLight.h"
#include "../../proj/mcu/register.h"
#include "../../proj/drivers/adc.h"

#define LED_INDICATE_VAL    (0xff)

#if WORK_SLEEP_EN
#define LIGHT_ADJUST_STEP_EN    0
#else
#define LIGHT_ADJUST_STEP_EN    1
#endif
#define LIGHT_NOTIFY_MESH_EN    0

#if UART_ENABLE
#include "../../proj/drivers/uart.h"

#define UART_DATA_LEN    44      // data max 252
typedef struct{
    u32 len;        // data max 252
    u8 data[UART_DATA_LEN];
}uart_data_t;
STATIC_ASSERT((sizeof(uart_data_t) % 16) == 0);

uart_data_t T_txdata_user;
uart_data_t T_txdata_buf;      // not for user

uart_data_t T_rxdata_user;
uart_data_t T_rxdata_buf;   // data max 252, user must copy rxdata to other Ram,but not use directly
unsigned char uart_rx_true;
#endif

#if(BQB_EN)
#include "../bqb/Phytest.h"

#define	rega_bqb_reboot	(0x3a)
#define BQB_MODE_FLAG	(0xab)
#endif

FLASH_ADDRESS_EXTERN;

#define		DEUBG_UART_HEX_EN				0

#define		DEUBG_UART_TEXT_EN				0

#if		DEUBG_UART_HEX_EN
#define		USBUART(d)		reg_usb_ep8_dat = d
#else
#define		USBUART(d)
#endif

u16 		ota_pkt_cnt = 0;
u32 		lum_changed_time = 0;
u32 		active_time = 0;
int			led_dbg;
u32			buff_response[48][9];
u8 			table_map_idx = 0;
u8 			write_master_data = 0;
u32 		light_lum_addr = 0;
u8			led_val[6] = {PMW_MAX_TICK_BASE, PMW_MAX_TICK_BASE, PMW_MAX_TICK_BASE, PMW_MAX_TICK_BASE, PMW_MAX_TICK_BASE, PMW_MAX_TICK_BASE};
u8          led_lum = 100;
u8          led_lum_tmp = 0;
u8          music_time = 0;
u32         last_music_tick = 0;
u32			led_event_pending;
u16			cmd_delay_ms = 0;
u16			cmd_left_delay_ms = 0;
u32 		irq_timer1_cb_time = 0;
u32         slave_send_data = 0;
u8 			light_off = 1;
ll_packet_l2cap_data_t cmd_delay;

fp_rf_led_ota_ok 			p_vendor_rf_led_ota_ok 			= 0;
fp_rf_led_ota_error			p_vendor_rf_led_ota_error 		= 0;
fp_irq_timer1 				p_vendor_irq_timer1 			= 0;
fp_proc_led 				p_vendor_proc_led 				= 0;
fp_rf_link_data_callback	p_vendor_rf_link_data_callback	= 0;
fp_user_init 				p_vendor_user_init				= 0;

#define		reg_debug_cmd		REG_ADDR16(0x800c)
#define 	PANEL_LED		    GPIO_PA5

// send_to_master 16bytes data, will be reset after send to master
extern u8 	send_to_master[];

extern u8 	max_mesh_name_len;
extern u8* 	slave_p_mac;
extern u16 	slave_group;
extern u32	slave_first_connected_tick;
extern u8 	pair_login_ok;
extern u8   not_need_login;
extern u8 	slave_link_connected;
extern u8	rf_link_key[];
extern u8 	max_relay_num;
extern ll_adv_private_t adv_pri_data;
extern ll_adv_rsp_private_t adv_rsp_pri_data;
extern u8	adv_private_data_len;
extern u8 security_enable;

////////////////////////////////////////////////////////////////////////////
rf_custom_dat_t slave_tx_cmd = {
		0x0, 0x0,					//nid,ttc
		0xffff,						//group
		0xffffffff,					//destination id
		{0x12, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},
	};
	
rf_custom1_dat_t slave_tx_cmd1 = {
	{0, 0, 0},
	{0x11, 0x11}
	};

// 0-100%  (pwm's value index: this is pwm compare value, and the pwm cycle is 255*256)
const u16 rgb_lumen_map[101] = {
  0,      5,     50,    130,  1*256,  2*256,  3*256,  4*256,  5*256,  6*256,  7*256,
      8*256,  9*256, 10*256, 11*256, 12*256, 13*256, 14*256, 15*256, 16*256, 17*256,
     18*256, 19*256, 21*256, 23*256, 25*256, 27*256, 29*256, 31*256, 33*256, 35*256,
     37*256, 39*256, 41*256, 43*256, 45*256, 47*256, 49*256, 51*256, 53*256, 55*256,
     57*256, 59*256, 61*256, 63*256, 65*256, 67*256, 69*256, 71*256, 73*256, 75*256,
     78*256, 81*256, 84*256, 87*256, 90*256, 93*256, 96*256, 99*256,102*256,105*256, 
    108*256,111*256,114*256,117*256,120*256,123*256,126*256,129*256,132*256,135*256,
    138*256,141*256,144*256,147*256,150*256,154*256,158*256,162*256,166*256,170*256,
    174*256,178*256,182*256,186*256,190*256,194*256,198*256,202*256,206*256,210*256,
    214*256,218*256,222*256,226*256,230*256,235*256,240*256,245*256,250*256,255*256,// must less or equal than (255*256)
};

//////////////////////////////////////////////////////
#define LED_MASK							0x07
#define	config_led_event(on,off,n,sel)		(on | (off<<8) | (n<<16) | (sel<<24))

#define	LED_EVENT_FLASH_4HZ_10S				config_led_event(2,2,40,LED_MASK)
#define	LED_EVENT_FLASH_STOP				config_led_event(1,1,1,LED_MASK)
#define	LED_EVENT_FLASH_2HZ_2S				config_led_event(4,4,4,LED_MASK)
#define	LED_EVENT_FLASH_1HZ_1S				config_led_event(8,8,1,LED_MASK)
#define	LED_EVENT_FLASH_1HZ_2S				config_led_event(8,8,2,LED_MASK)
#define	LED_EVENT_FLASH_1HZ_3S				config_led_event(8,8,3,LED_MASK)
#define	LED_EVENT_FLASH_1HZ_4S				config_led_event(8,8,4,LED_MASK)
#define	LED_EVENT_FLASH_4HZ					config_led_event(2,2,0,LED_MASK)
#define	LED_EVENT_FLASH_1HZ					config_led_event(8,8,0,LED_MASK)
#define	LED_EVENT_FLASH_4HZ_3T				config_led_event(2,2,3,LED_MASK)
#define	LED_EVENT_FLASH_1HZ_3T				config_led_event(8,8,3,LED_MASK)
#define	LED_EVENT_FLASH_0p25HZ_1T			config_led_event(4,60,1,LED_MASK)
#define	LED_EVENT_FLASH_2HZ_1T				config_led_event(4,4,1,LED_MASK)
#define	LED_EVENT_FLASH_2HZ_2T				config_led_event(4,4,2,LED_MASK)

extern void light_set_tick_per_us(int tick);
extern void	rf_link_slave_pairing_enable(int en);
extern void	rf_link_slave_set_buffer (u32 *p, u8 n);
extern int rf_link_get_op_para(u8 *p, u8 *op, u8 *op_len, u8 *para, u8 *para_len, u8 mesh_flag);
void retention_test();

void	pwm_set_lum (int id, u16 y, int pol)
{
    u32 lum = ((u32)y * PMW_MAX_TICK) / (255*256);

	pwm_set_cmp (id, pol ? PMW_MAX_TICK - lum : lum);
}

u32 get_pwm_cmp(u8 val, u8 lum){
    if(lum >= ARRAY_SIZE(rgb_lumen_map) - 1){
        lum = ARRAY_SIZE(rgb_lumen_map) - 1;
    }
    u16 val_lumen_map = rgb_lumen_map[lum];
    
#if LIGHT_ADJUST_STEP_EN
    light_step_correct_mod(&val_lumen_map, lum);
#endif
    u32 val_temp = val;
    return (val_temp * val_lumen_map) / 255;
}

void light_adjust_R(u8 val, u8 lum){
    pwm_set_lum (PWMID_R, get_pwm_cmp(val, lum), PWM_INV_R);
}

void light_adjust_G(u8 val, u8 lum){
    pwm_set_lum (PWMID_G, get_pwm_cmp(val, lum), PWM_INV_G);
}

void light_adjust_B(u8 val, u8 lum){
    pwm_set_lum (PWMID_B, get_pwm_cmp(val, lum), PWM_INV_B);
}

void light_adjust_RGB_hw(u8 val_R, u8 val_G, u8 val_B, u8 lum){
	light_adjust_R(val_R, lum);
	light_adjust_G(val_G, lum);
	light_adjust_B(val_B, lum);
}

void light_adjust_RGB(u8 val_R, u8 val_G, u8 val_B, u8 lum){
    #if LIGHT_ADJUST_STEP_EN
    light_onoff_step_init();
    #endif

	light_adjust_RGB_hw(val_R, val_G, val_B, lum);
}

void light_onoff_normal(u8 on){
    if(on){
        light_off = 0;
    	light_adjust_RGB_hw(led_val[0], led_val[1], led_val[2], led_lum);
	}else{
        light_off = 1;
    	light_adjust_RGB_hw(0, 0, 0, 0);        
	}
}

void device_status_update(){
    // packet
    u8 st_val_par[MESH_NODE_ST_PAR_LEN] = {0};
    memset(st_val_par, 0xFF, sizeof(st_val_par));
    // led_lum should not be 0, because app will take it to be light off
#if SUB_ADDR_EN
    st_val_par[0] = get_sub_addr_onoff();                           //Note: bit7 of par[0] have been use internal for FLD_SYNCED
#else
    st_val_par[0] = light_off ? 0x00 : (led_lum ? led_lum : 1);     //Note: bit7 of par[0] have been use internal for FLD_SYNCED
#endif

#if(WORK_SLEEP_EN)
    extern u8 need_sleep;
	st_val_par[1] = need_sleep;
#else
	st_val_par[1] = 0xFF;   // rsv
#endif
    // end
    
    ll_device_status_update(st_val_par, sizeof(st_val_par));
}

