retsimx/tlsr8266_mesh/sdk/vendor/light_8258/main_light.c
void proc_led(void)
{
	if(p_vendor_proc_led){
		p_vendor_proc_led();
		return;
	}
	static	u32 led_ton;
	static	u32 led_toff;
	static	int led_sel;						//
	static	u32 led_tick;
	static	int led_no;
	static	int led_is_on;

	if(!led_count && !led_event_pending) {
		return;  //led flash finished
	}

	if (led_event_pending)
	{
		// new event
		led_ton = (led_event_pending & 0xff) * 64000 * CLOCK_SYS_CLOCK_1US;
		led_toff = ((led_event_pending>>8) & 0xff) * 64000 * CLOCK_SYS_CLOCK_1US;
		led_count = (led_event_pending>>16) & 0xff;
		led_sel = led_event_pending>>24;

		led_event_pending = 0;
		led_tick = clock_time () + 30000000 * CLOCK_SYS_CLOCK_1US;
		led_no = 0;
		led_is_on = 0;
	}

	if( 1 ){
		if( (u32)(clock_time() - led_tick) >= (led_is_on ? led_ton : led_toff) ){
			led_tick = clock_time ();
			int led_off = (led_is_on || !led_ton) && led_toff;
			int led_on = !led_is_on && led_ton;

			led_is_on = !led_is_on;
			if (led_is_on)
			{
				led_no++;
				led_dbg++;
				if (led_no - 1 == led_count)
				{
					led_count = led_no = 0;
					light_onoff_hw(!light_off); // should not report online status again
					return ;
				}
			}
			
			if( led_off || led_on  ){
                if (led_sel & BIT(0))
                {
                    light_adjust_G (LED_INDICATE_VAL * led_on, 100);
                }
                if (led_sel & BIT(1))
                {
                    light_adjust_B (LED_INDICATE_VAL * led_on, 100);
                }
                if (led_sel & BIT(2))
                {
                    light_adjust_R (LED_INDICATE_VAL * led_on, 100);
                }
                if (led_sel & BIT(5))
                {
                }
            }
        }
	}

}

void mesh_ota_master_led(u8 *p)
{
    if((0 == led_count) && (!led_event_pending)){
        cfg_led_event (LED_EVENT_FLASH_0p25HZ_1T);
    }
}

void	proc_debug () {
    return ;    // can not use 0x8004~0x800d

	u16	udat = reg_debug_cmd;
	u8	cmd = udat >> 8;
	u8  adr = udat;
	u8	dat;
	if (cmd == 0xff) {			//read command
		dat = analog_read (adr);
		reg_debug_cmd = dat | 0x5500;
	}
	else if (cmd <= 0x20 || (cmd>=0x80 && cmd <=0xc0)) {	//write command
		analog_write (cmd, adr);
		dat = analog_read (cmd);
		reg_debug_cmd = dat | 0x6600;
	}
	else if (cmd == 0xfe) {	//set channel mask
		//chn_mask_fix = adr;
		//reg_debug_cmd = adr | 0x6700;
	}
	else if (cmd == 0xfd) {	//set tx power
		rf_set_power_level_index (adr & 15);
		reg_debug_cmd = adr | 0x6800;
	}

}

//--------------------gpio irq handle-------------------//
void gpio_irq_user_handle(){
	return;
}

void gpio_risc0_user_handle(){
	return;
}

void gpio_risc1_user_handle(){
	return;
}
//-----------------------end gpio irq handle-------------------------//

extern rf_packet_att_cmd_t	pkt_light_notify;

int light_notify(u8 *p, u8 len, u8* p_src){
    int err = -1;
    if(slave_link_connected && pair_login_ok){
        if(len > 10){   //max length of par is 10
            return -1;
        }
        
        pkt_light_notify.value[3] = p_src[0];
        pkt_light_notify.value[4] = p_src[1];
        
        u8 *p_par = &(pkt_light_notify.value[10]);
        memset(p_par, 0, 10);
        memcpy(p_par, p, len);
        u8 r = irq_disable();
        if (is_add_packet_buf_ready()){
            if(0 != rf_link_add_tx_packet ((u32)(&pkt_light_notify))){
                err = 0;
            }
        }
        irq_restore(r);
    }

    return err;
}

void light_sim_notify(void){    // just local light can use.
	static u32 cur_time = 0;
	static u8 cnt = 0;
	if(clock_time_exceed(cur_time, 5000*1000)){
		cur_time = clock_time();
	    #if 1
        u8 buf[10] = {0};
        buf[0] = cnt++;
        light_notify(buf, sizeof(buf), (u8 *)&device_address);
	    #else
		extern u8 SppDataServer2ClientData[];
		SppDataServer2ClientData[0] = cnt++;
		extern void sim_send_status(void);
		sim_send_status();
		#endif
	}
}

#if (LIGHT_NOTIFY_MESH_EN)
void light_sim_notify_mesh(void){    // all light can use.
	static u32 last_time = 0;
	if(clock_time_exceed(last_time, 5000*1000)){
        if(!is_tx_cmd_busy()){   // it must be used, if want enough bridges(default is BRIDGE_MAX_CNT 8).
    		last_time = clock_time();
    		static u8 cnt = 0;
    		u8 op_para[16] = {0, 0, 0, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12};
    		op_para[0] = LGT_CMD_NOTIFY_MESH;
    		op_para[3] = (++cnt);
    		light_slave_tx_command(op_para, 0xFFFF);
		}
	}
}
#endif

void light_sim_light2light(void){
	static u32 last_time = 0;
	if(clock_time_exceed(last_time, 5000*1000)){
        if(!is_tx_cmd_busy()){   // it must be used, if want enough bridges(default is BRIDGE_MAX_CNT 8).
    		last_time = clock_time();
    		static u8 cnt = 0;
    		u8 op_para[16] = {0};
    		op_para[0] = LGT_CMD_LIGHT_ONOFF;
    		op_para[3] = (++cnt)%2;//params[0], on or off
    		light_slave_tx_command(op_para, 0xFFFF);//0xFFFF or 0x8001......
        }
	}
}

void light_hw_timer0_config(void){
#if IRQ_TIMER0_ENABLE
 	//enable timer0 interrupt
	reg_irq_mask |= FLD_IRQ_TMR0_EN;
	reg_tmr0_tick = 0;
	reg_tmr0_capt = CLOCK_MCU_RUN_CODE_1US * IRQ_TIME0_INTERVAL;
	reg_tmr_ctrl |= FLD_TMR0_EN;
#endif
}

void light_hw_timer1_config(void){
 	//enable timer1 interrupt
	reg_irq_mask |= FLD_IRQ_TMR1_EN;
	reg_tmr1_tick = 0;
	reg_tmr1_capt = CLOCK_MCU_RUN_CODE_1US * IRQ_TIME1_INTERVAL * 1000;
	
    #if (SYNC_TIME_EN)
	sync_10ms_tick_last = clock_time();     // init
	#endif
	reg_tmr_ctrl |= FLD_TMR1_EN;
}

// p_cmd : cmd[3]+para[10]
// para    : dst
int light_slave_tx_command_ll(u8 *p_cmd, int para, u8 sub_addr)
{
    static u8 dbg_tx = 0;
    dbg_tx++;

    if(is_bridge_task_busy()){
        return 0;	// user should retry tx command to handle this case.
    }
    
    u8 cmd_op_para[16] = {0};
    static int cmd_sno = 0;
    cmd_sno = clock_time() + device_address;
    memset(cmd_op_para, 0, 16);
    memcpy(cmd_op_para, p_cmd, 13);
    cmd_op_para[0] = p_cmd[0] | 0xc0;
    cmd_op_para[1] = VENDOR_ID & 0xFF;
    cmd_op_para[2] = VENDOR_ID >> 8;
    #if 0   // for test
    static u8 a_oppara[16];
    memcpy(a_oppara, p_cmd, 16);
    #endif

    u16 dst = (u16)para;
    #if SUB_ADDR_EN
    if(sub_addr){
        mesh_push_user_command_sub_addr(cmd_sno++, sub_addr, dst, cmd_op_para, 13);
    }else
    #endif
    {
        mesh_push_user_command(cmd_sno++, dst, cmd_op_para, 13);
    }

    return 1;
}

int light_slave_tx_command(u8 *p_cmd, int para)
{
    return light_slave_tx_command_ll(p_cmd, para, 0);
}

#if SUB_ADDR_EN
int light_slave_tx_command_sub_addr(u8 *p_cmd, int para, u8 sub_addr)
{
    return light_slave_tx_command_ll(p_cmd, para, sub_addr);
}
#endif

enum{
	LUM_SAVE_FLAG = 0xA5,
};

