retsimx/tlsr8266_mesh/sdk/vendor/light_8258/main_light.c
                light_adjust_RGB(led_val[0], led_val[1], led_val[2], led_lum);
                
                lum_changed_time = clock_time();
            }
        	else if (op == LGT_CMD_SET_RGB_VALUE)
        	{
        	    if(light_off){
        	        return;
        	    }
        		if(params[0] == 1){		        //R
        		    led_val[0] = params[1];
                    light_adjust_R (led_val[0], led_lum);
        		}else if(params[0] == 2){		//G
        		    led_val[1] = params[1];
                    light_adjust_G (led_val[1], led_lum);
        		}else if(params[0] == 3){		//B
        		    led_val[2] = params[1];
                    light_adjust_B (led_val[2], led_lum);
        		}else if(params[0] == 4){		//RGB
        		    led_val[0] = params[1];
        		    led_val[1] = params[2];
        		    led_val[2] = params[3];
        		    light_adjust_RGB(led_val[0], led_val[1], led_val[2], led_lum);
        		}else if(params[0] == 5){		//CT
        		    //temporary processing as brightness
                    if(light_off || params[1] > 100 || led_lum == params[1]){
                        return;
                    }
                    led_lum = params[1];
                    light_adjust_RGB(led_val[0], led_val[1], led_val[2], led_lum);
        		}
        		
                lum_changed_time = clock_time();
        	}
        	else if (op == LGT_CMD_KICK_OUT)
        	{
        		if(is_mesh_cmd_need_delay(p, params, pp->val[op_cmd_len+params_len])){
        			return ;
        		}
        	    irq_disable();
        	    void kick_out(u8 par);
        	    kick_out(params[0]);
        	    light_sw_reboot();
        	}
#if(ALARM_EN)
        	else if (op == LGT_CMD_SET_TIME)
        	{
                rtc_t rtc_old, rtc_new;
                memcpy(&rtc_old, &rtc, sizeof(rtc_t));
        	    memcpy(&rtc_new.year, params, 7);
        	    if(0 == rtc_set_time((rtc_t *)params)){
        	        //ok
        	        check_event_after_set_time(&rtc_new, &rtc_old);
                    cfg_led_event(LED_EVENT_FLASH_1HZ_3T);
        	    }else{
        	        //invalid params
                    cfg_led_event(LED_EVENT_FLASH_4HZ_3T);
        	    }
        	}
        	else if (op == LGT_CMD_ALARM)
        	{
        	    if(0 == alarm_ev_callback((u8*)params)){
                    cfg_led_event(LED_EVENT_FLASH_1HZ_3T);
        	    }else{
                    cfg_led_event(LED_EVENT_FLASH_4HZ_3T);
        	    }
        	}
#endif        	
#if(SCENE_EN)
        	else if (op == LGT_CMD_SET_SCENE)
        	{
        	    if(params[0] == SCENE_ADD){
        	        // add scene: params valid & no repetition
        	        scene_t *pData = (scene_t*)(params+1);
        	        if(pData->id && pData->lum <= 100 
            	            && pData->rgb[0] <= 0xFF
            	            && pData->rgb[1] <= 0xFF
            	            && pData->rgb[2] <= 0xFF){
                        if(scene_add(pData)){
                            cfg_led_event(LED_EVENT_FLASH_1HZ_3T);
                        }
        	        }
        	            
        	    }else if(params[0] == SCENE_DEL){
        	        // del scene
        	        if(scene_del(params[1])){
                        cfg_led_event(LED_EVENT_FLASH_1HZ_3T);
        	        }
        	    }
        	}
        	else if (op == LGT_CMD_LOAD_SCENE)
        	{
        	    scene_load(params[0]);
        	}
#endif
#if 1 // (LIGHT_NOTIFY_MESH_EN)
            else if (op == LGT_CMD_NOTIFY_MESH)
            {
                #if (NOTIFY_MESH_COMMAND_TO_MASTER_EN)
                notify_mesh_data_t * p_buf = (notify_mesh_data_t *)pp;
                if(p_buf->src_adr == device_address)// other case: push fifo in rx_mesh_adv_message_cb()
                #endif
                {
                    #if NOTIFY_MESH_FIFO_EN
                    my_fifo_push_mesh_notify(pp);
                    #else
                    light_notify(pp->val+3, 10, pp->src);
                    #endif
                }
            }
#endif        	
            else if (op == LGT_CMD_MESH_OTA_DATA)
            {
                u16 idx = params[0] + (params[1] << 8);
                if(!is_master_ota_st()){  // no update firmware for itself
                    if(CMD_START_MESH_OTA == idx){
                        mesh_ota_master_start_firmware_from_own();
                        //cfg_led_event(LED_EVENT_FLASH_1HZ_4S);
                    }else if(CMD_STOP_MESH_OTA == idx){
                        if(is_mesh_ota_slave_running()){
                            // reboot to initial flash: should be delay to relay command.
                            mesh_ota_slave_reboot_delay();  // reboot after 320ms
                        }
                    }else{
                        if(mesh_ota_slave_save_data(params)){
                            static u16 mesh_ota_error_cnt;
                            mesh_ota_error_cnt++;
                        }
                    }
                }else{
                    if(CMD_STOP_MESH_OTA == idx){
                        mesh_ota_master_cancle(OTA_STATE_MASTER_OTA_REBOOT_ONLY, 0);
                        //cfg_led_event(LED_EVENT_FLASH_4HZ_3T);
                    }
                }
            }
#if(MESH_PAIR_ENABLE)
            else if (op == LGT_CMD_MESH_PAIR)
            {
                mesh_pair_cb(params);
            }
#endif
#if(WORK_SLEEP_EN)
			else if (op == LGT_CMD_WORK_OR_SLEEP)
			{
				extern u8 need_sleep;
				extern u8 need_sleep_pre;
				if(params[0] == DUTY_CMD_WORK){
					if(need_sleep && mesh_user_cmd_idx == 0){
						extern void send_duty_cmd(u8 cmd_type);
						send_duty_cmd(DUTY_CMD_WORK);
					}
                	hb_timeout_pre = need_sleep_pre = need_sleep = 0;
				}else if(params[0] == DUTY_CMD_SLEEP){//sleep,not use yet
                	need_sleep_pre = 1;
				}else if(params[0] == DUTY_CMD_HB){
					#if 0
					if(!is_ble_connecting()){
						light_onoff_hw(0);
						sleep_us(100*1000);
						light_onoff_hw(1);
						sleep_us(100*1000);
						light_onoff_hw(0);
						sleep_us(100*1000);
						light_onoff_hw(1);
					}
					#endif
					//last_rcv_hb_time = clock_time() | 1;
				}
			}
#endif
#if(FEATURE_FRIEND_EN)
            else if (op == LGT_CMD_FRIENDSHIP){
                mesh_pkt_t *pkt = CONTAINER_OF(pp->sno,mesh_pkt_t,sno);
                fn_rx_friendship_cmd_proc(pkt);
            }
#endif
            else{
#if NOTIFY_MESH_COMMAND_TO_MASTER_EN
                rf_link_data_callback_user_cmd(p, op);
#endif
            }
        }
    }
}

