retsimx/tlsr8266_mesh/sdk/vendor/light_8258/main_light.c
	rf_link_slave_set_buffer (buff_response[0], 48);

	//rf_link_set_debug_adv_channel (38);

	rf_link_set_max_bridge (BRIDGE_MAX_CNT);
	vendor_id_init(VENDOR_ID);
	
	usb_dp_pullup_en (1);

	//extern void	rf_link_set_max_relay (u8 num);
	//rf_link_set_max_relay (3);
	
	light_hw_timer0_config();
	light_hw_timer1_config();

	extern u32 online_status_timeout;
    online_status_timeout = ONLINE_STATUS_TIMEOUT;
    
#if(PA_ENABLE)
    pa_init(0, 0);
#endif

#if(SCENE_EN)
    scene_init();
#endif

#if(MESH_PAIR_ENABLE)
	mesh_pair_init();
#endif
}

void light_set_master_data(void){
	// write_master_data means need to send some data to master,just padding data into send_to_master[]
	if(write_master_data){
		write_master_data = 0;
		memcpy(send_to_master, (u8*)&slave_send_data, 4);
	}
}

void light_auth_check(void){
	if(security_enable && !pair_login_ok && slave_first_connected_tick && clock_time_exceed(slave_first_connected_tick, AUTH_TIME*1000*1000)){
		//rf_link_slave_disconnect(); // must login in 60s after connected, if need
		slave_first_connected_tick = 0;
	}
}

void light_user_func(void){
	light_set_master_data();
	
	light_auth_check();

#if(!WORK_SLEEP_EN)
    extern int factory_reset_cnt_check ();
	factory_reset_cnt_check();
#endif

    extern int factory_reset_cnt_check ();
	factory_reset_cnt_check();
	
	// save current lum-val
	if(lum_changed_time && clock_time_exceed(lum_changed_time, 5000*1000)){
		lum_changed_time = 0;
		light_lum_store();
	}

	// music function timeout
	if(last_music_tick && clock_time_exceed(last_music_tick, 3000*1000)){
	    music_time = last_music_tick = 0;
        led_lum = led_lum_tmp;
        light_adjust_RGB(led_val[0], led_val[1], led_val[2], led_lum);
	}

#if(MESH_PAIR_ENABLE)
	mesh_pair_proc_effect();
#endif
    
#if(BQB_EN)	// trigger to BQB mode, user should redefine here
	static u32 bqb_start_time = 0;
    if(!bqb_en_flag && !bqb_start_time && clock_time_exceed(bqb_start_time, 5000*1000)){
        bqb_start_time = clock_time() | 1;
		analog_write(rega_bqb_reboot, BQB_MODE_FLAG);
		light_sw_reboot();
    }
#endif

#if 0// deepsleep timer wakeup -- demo code
	static u32 deep_time = 0;
	if(deep_time == 0){
		deep_time = clock_time() | 1;
	}
	if(clock_time_exceed(deep_time, 5*1000*1000)){
		extern u32 tick_per_us;
		//cpu_sleep_wakeup(DEEPSLEEP_MODE, PM_WAKEUP_TIMER, clock_time() + 5*1000*1000 * tick_per_us);  //no-retention deepsleep
		cpu_sleep_wakeup(DEEPSLEEP_MODE_RET_SRAM, PM_WAKEUP_TIMER, clock_time() + 5*1000*1000 * tick_per_us);  //retention deepsleep
	}
#endif

}

////////////////////////////////////////////////////////////////////////////
void main_loop(void)
{
	static u32  dbg_m_loop;
	dbg_m_loop++;
	
	// retention_test();
	
	if(is_receive_ota_window()){
		return ;
	}
	
    // simple_sleep_duty_cycle();

#if(BQB_EN)
	if(bqb_en_flag == 1){
	    static u8 irq_flag = 1;
	    if(irq_flag){
	        irq_flag = 0;
            irq_disable();
	    }
		extern void main_loop_bqb(void);
		main_loop_bqb();
		return;
	}
#endif

	//flash_protect_debug();
	
#if(ALARM_EN)
	alarm_handle();
#endif

#if(SCENE_EN)
	scene_handle();
#endif	
    
	//light_sim_light2light();
	//light_sim_notify();
#if(LIGHT_NOTIFY_MESH_EN)
	light_sim_notify_mesh();
#endif	

	light_user_func ();
	
	rf_link_slave_proc ();

	proc_led ();
#if (BATT_CHECK_ENABLE)
    app_battery_power_check_and_sleep_handle(1);
#endif
#if GATEWAY_EN
    proc_ui_gateway ();
#endif    

#if(STACK_CHECK_ENABLE)
    stack_check();
#endif

	//proc_debug ();

#if DEUBG_UART_TEXT_EN
	printf ("main loop: %d\r\n", dbg_m_loop);
	sleep_us (100000);
#endif

#if DEUBG_UART_HEX_EN
	USBUART (dbg_m_loop>>24);
	USBUART (dbg_m_loop>>16);
	USBUART (dbg_m_loop>>8);
	USBUART (dbg_m_loop);
#endif

#if UART_ENABLE 
    if(uart_rx_true){
        uart_rx_true = 0;
        u32 rx_len = T_rxdata_buf.len + 4 > sizeof(T_rxdata_user) ? sizeof(T_rxdata_user) : T_rxdata_buf.len + 4;
        memcpy(&T_rxdata_user, &T_rxdata_buf, rx_len);
        uart_Send((u8 *)(&T_rxdata_user));
    }
#endif

#if ADC_ENABLE
    static u32 adc_check_time;
    if(clock_time_exceed(adc_check_time, 1000*1000)){
        adc_check_time = clock_time();
        static u16 T_adc_val;
        T_adc_val = adc_BatteryValueGet();
    }    
#endif
#if ADC_SET_CHN_ENABLE
	static u32 adc_tmp_check_time;
	if(clock_time_exceed(adc_tmp_check_time, 40*1000)){
        adc_tmp_check_time = clock_time();
		static u32 T_adc_mv;
		T_adc_mv = adc_sample_and_get_result();
    }
#endif

#if  ADC_TEMP_ENABLE
	adc_adj_tp_handle();
#endif
	
#if(WORK_SLEEP_EN)
	extern void main_loop_sleep_proc(void);
	main_loop_sleep_proc();
#endif

#if FEATURE_FRIEND_EN
    friendship_proc_fn();
#endif

#if DUAL_MODE_ADAPT_EN
    dual_mode_loop_proc();
#endif

#if NOTIFY_MESH_FIFO_EN
    notify_mesh_fifo_proc ();
#endif

#if NOTIFY_MESH_COMMAND_TO_MASTER_EN
    nctm_loop();
#endif
}

////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////
#if (PM_DEEPSLEEP_RETENTION_ENABLE)
_attribute_ram_code_ 
#endif
void user_init_pwm(int retention_flag)
{
    pwm_set (PWMID_R, PMW_MAX_TICK, PWM_INV_R ? 0 : PMW_MAX_TICK);
    pwm_set (PWMID_G, PMW_MAX_TICK, PWM_INV_G ? 0 : PMW_MAX_TICK);
    pwm_set (PWMID_B, PMW_MAX_TICK, PWM_INV_B ? 0 : PMW_MAX_TICK);

    if(retention_flag){
        light_onoff(!light_off);
    }else{
		//retrieve lumen value
		light_lum_retrieve();
    }

    pwm_start (PWMID_R);
    pwm_start (PWMID_G);
    pwm_start (PWMID_B);

    gpio_set_func (PWM_R, PWM_FUNC_R);
    gpio_set_func (PWM_G, PWM_FUNC_G);
    gpio_set_func (PWM_B, PWM_FUNC_B);

    pwm_io_input_disable();
}

#if (PM_DEEPSLEEP_RETENTION_ENABLE)
_attribute_ram_code_ 
#endif
void user_init_peripheral(int retention_flag)
{
#if ADC_TEMP_ENABLE || ADC_SET_CHN_ENABLE || ADC_ENABLE
	adc_drv_init();
#endif

    light_hw_timer0_config();
    light_hw_timer1_config();

#if UART_ENABLE
#if(MCU_CORE_TYPE == MCU_CORE_8258 || MCU_CORE_TYPE == MCU_CORE_8278)
	//note: dma addr must be set first before any other uart initialization! (confirmed by sihui)
    uart_recbuff_init((unsigned short *)(&T_rxdata_buf), sizeof(T_rxdata_buf), (u8 *)(&T_txdata_buf));
	uart_gpio_set(UART_TX_PIN, UART_RX_PIN);// uart tx/rx pin set

	uart_reset();  //will reset uart digital registers from 0x90 ~ 0x9f, so uart setting must set after this reset

	//baud rate: 115200
	#if (CLOCK_SYS_CLOCK_HZ == 16000000)
	uart_init(9, 13, PARITY_NONE, STOP_BIT_ONE);
	#elif (CLOCK_SYS_CLOCK_HZ == 32000000)
	uart_init(30, 8, PARITY_NONE, STOP_BIT_ONE);
	#endif
	
	uart_dma_enable(1, 1);	//uart data in hardware buffer moved by dma, so we need enable them first

	irq_set_mask(FLD_IRQ_DMA_EN);
	dma_chn_irq_enable(FLD_DMA_CHN_UART_RX | FLD_DMA_CHN_UART_TX, 1);		//uart Rx/Tx dma irq enable
	reg_dma_rx_rdy0 = FLD_DMA_CHN_UART_RX | FLD_DMA_CHN_UART_TX;

#else
    //Initial IO
    //UART_GPIO_CFG_PA6_PA7();
    //UART_GPIO_CFG_PC2_PC3();
    UART_GPIO_CFG_PB2_PB3();
    
    CLK32M_UART115200;
    uart_BuffInit((u8 *)(&T_rxdata_buf), sizeof(T_rxdata_buf), (u8 *)(&T_txdata_buf));
#endif	
#endif

#if GATEWAY_EN
	if(retention_flag){
		host_init();
	}else{
	    gateway_init();
	    gateway_mode_onoff(1);
	    gateway_security = 0;
	    gateway_set_login_flag();
	}
#endif

#if I2C_HW_MODOULE_EN   // I2C init
    #if I2C_MASTER_MODE
    i2c_master_init((0x44<<1), 8);//set clk to 500k
    i2c_gpio_set(I2C_GPIO_GROUP_C0C1);
    #else
    //// slave mode
    #endif
#endif

#if FN_DEBUG_PIN_EN
    fn_debug_gpio_init();
#endif
}

