retsimx/tlsr8266_mesh/sdk/vendor/light_8258/main_light.c
void  user_init(void)
{
    #if (BATT_CHECK_ENABLE)
    app_battery_power_check_and_sleep_handle(0); //battery check must do before OTA relative operation
    #endif
	blc_readFlashSize_autoConfigCustomFlashSector();
#if DEBUG_GPIO_EN
    const u32 dbg_pin[] = { DBG_PIN_BLE_CONN, DBG_PIN_BLE_ST_RX, DBG_PIN_BLE_IRQ_RX, 
                            DBG_PIN_BLE_CRC_OK, DBG_PIN_BLE_ST_LISTEN, DBG_PIN_BLE_RC_DATA};
    foreach_arr(i,dbg_pin){
        gpio_set_func(dbg_pin[i], AS_GPIO);
        gpio_set_input_en(dbg_pin[i], 0);
        gpio_set_output_en(dbg_pin[i], 1);
    	gpio_write(dbg_pin[i], 0);
	}
#endif
	
#if(BQB_EN)
	if(BQB_MODE_FLAG == analog_read(rega_bqb_reboot)){
		#if(MODULE_WATCHDOG_ENABLE)
		wd_stop();
		#endif
		Bqb_Init();
		bqb_en_flag = 1;
		return;
	}
#endif

#if DUAL_MODE_ADAPT_EN
	dual_mode_en_init();    // must before factory_reset_handle and erase ota data, because "dual_mode_state" is used in it.
#endif

    flash_get_id();
    
#if 1	
	// for app ota   
	if(0 == is_ota_area_valid(ota_program_offset)){ // 8267 / 8269 should use "ota_program_offset"
		erase_ota_data(ota_program_offset);
	}
#endif
	
    flash_protect_8267_normal();    // must after erase_sector for OTA

	extern void set_vendor_function(void);
	set_vendor_function();

	light_init_default();
    user_init_pwm(0);
	
#if (SW_NO_PAIR_ENABLE)
	extern u8 sw_no_pair;
	sw_no_pair = 1;
#endif
	rf_link_slave_init (40000);

    extern int factory_reset_handle ();
    factory_reset_handle();

	extern void vendor_set_adv_data(void);
	vendor_set_adv_data();

	user_init_peripheral(0);
#if(IBEACON_ENABLE)
	#if 0 // apple ibeacon
    if (*(u16 *) FLASH_ADR_BEACON_MAJOR != 0xFFFF){
    	u16 major_data = *(u16 *) FLASH_ADR_BEACON_MAJOR;
    	major_data = (major_data << 8) | ((major_data >> 8) & 0x00FF);
        ibeacon_customer_data.major = major_data;
    }
    if (*(u16 *) FLASH_ADR_BEACON_MINOR != 0xFFFF){
    	u16 minor_data = *(u16 *) FLASH_ADR_BEACON_MINOR;
    	minor_data = (minor_data << 8) | ((minor_data >> 8) & 0x00FF);
        ibeacon_customer_data.minor = minor_data;
    }
    if (*(u32 *) FLASH_ADR_BEACON_UUID != 0xFFFFFFFF){
		u8 customer_UUID[16] = {0};
    	flash_read_page(FLASH_ADR_BEACON_UUID, 16, customer_UUID);
		memcpy(ibeacon_customer_data.proximity_UUID, customer_UUID, 16);
    }
    if (*(u16 *) FLASH_ADR_BEACON_COMPANYID != 0xFFFF){
		ibeacon_customer_data.company_ID = *(u16 *) FLASH_ADR_BEACON_COMPANYID;
    }
    
    beacon_len = sizeof(ibeacon_adv_t);
    memcpy(iBeaconData, &ibeacon_customer_data, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
	#endif
    #if 0 // eddystone UID
    extern u8 mac_id[];
    memcpy(eddystone_uid + 23, mac_id, 6);
    beacon_len = 31;
    memcpy(iBeaconData, eddystone_uid, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
    #endif
    #if 0 // eddystone URL
    beacon_len = eddystone_url[0]+eddystone_url[3]+eddystone_url[7]+3;
    memcpy(iBeaconData, eddystone_url, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
    #endif
    #if 0 // eddystone TLM
    beacon_len = 25;
    memcpy(iBeaconData, eddystone_tlm, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
    #endif
    iBeaconInterval = IBEACON_INTERVAL;
	beacon_with_mesh_adv = 1;
#endif

#if(STACK_CHECK_ENABLE)
    stack_check_init();
#endif

#if (SYNC_TIME_EN)
    sync_time_en(1);
#endif    
	device_status_update();
    mesh_security_enable (1);
	
	if(!security_enable){
	    //not_need_login = pair_login_ok = 1;// 1 means not need login when no-security mode.
	}else{
	    //extern u8 rands_fix_flag;
        //rands_fix_flag = 1;       // 1 means rands[8] = {0xb0, 0xb1, 0xb2, 0xb3, 0xb4, 0xb5, 0xb6, 0xb7};
	}

    #if (0 || WORK_SLEEP_EN) // callback for node status changed
    extern void light_node_status_change_cb(u8 *p, u8 new_node);
    extern void	register_mesh_node_status_callback (void *p);
    register_mesh_node_status_callback(&light_node_status_change_cb);
    #endif

    #if 0// 'set_mesh_info_time' means after this time from power-on,set mesh info will be refused.
    extern u32 set_mesh_info_time;// unit: s
    set_mesh_info_time = 30;
    #endif
    
    #if 0
    extern u8 send_adv_flag; // default value is 1, 0 means don't send adv pkt.
    send_adv_flag = 0;
    #endif
    
    register_mesh_ota_master_ui(mesh_ota_master_led);   //  mesh_ota_master_led() will be called when sending mesh ota data.

#if FN_DEBUG_PIN_EN
    fn_debug_gpio_init();
#endif

#if (DUAL_MODE_ADAPT_EN)
    dual_mode_sig_mesh_par_init();
#endif

#if NOTIFY_MESH_COMMAND_TO_MASTER_EN
    nctm_user_init();
#endif
}
#endif

#if (PM_DEEPSLEEP_RETENTION_ENABLE)
_attribute_ram_code_ void user_init_deepRetn(void)
{
    blc_ll_initBasicMCU();   //mandatory
	rf_set_power_level_index (MY_RF_POWER_INDEX);
    blc_ll_recoverDeepRetention();
    user_init_pwm(1);
    user_init_peripheral(1);
    // should enable IRQ here, because it may use irq here, for example BLE connect.
    // irq_enable();
}

void retention_test()
{
    static u8 A_retention_test;
    extern int slave_link_state;
    if(A_retention_test && (slave_link_state != FLG_SYS_LINK_CONNECTED)){
        A_retention_test = 0;
        u32 t_ms = ((slave_link_state == FLG_SYS_LINK_ADV) || (slave_link_state == FLG_SYS_LINK_LISTEN)) ? 10000 : 100;
        cpu_sleep_wakeup(DEEPSLEEP_MODE_RET_SRAM, PM_WAKEUP_TIMER, clock_time() + t_ms*1000*16);
    }
}
#endif

